# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..ForwardIterator Method
MEPBuildingConstructionSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual MEPBuildingConstructionSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As MEPBuildingConstructionSetIterator
```

Visual C++
---
```text
public:
virtual MEPBuildingConstructionSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace